Revit 2024 API
NurbsSurfaceData.GetKnotsU Method
 Get the list of knots in the u-direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public IList<double> GetKnotsU()
Visual Basic
Public Function GetKnotsU As IList(Of Double)
Visual C++
public:
IList<double>^ GetKnotsU()
See Also
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace